RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/StdDriver/src/nu_usci_i2c.c
    UI2C_START(ui2c);                                                       /* Send START */

    while(u8Xfering)
    {
        while(!(UI2C_GET_PROT_STATUS(ui2c) & 0x3F00U));                      /* Wait UI2C new status occur */

        switch(UI2C_GET_PROT_STATUS(ui2c) & 0x3F00U)
        {
            case UI2C_PROTSTS_STARIF_Msk:
                UI2C_CLR_PROT_INT_FLAG(ui2c, UI2C_PROTSTS_STARIF_Msk);     /* Clear START INT Flag */

                if(eEvent == MASTER_SEND_START)
                {
                    UI2C_SET_DATA(ui2c, (uint16_t)(u8SlaveAddr << 1U) | 0x00U);          /* Write SLA+W to Register UI2C_TXDAT */
                    eEvent = MASTER_SEND_ADDRESS;
                }
                else if(eEvent == MASTER_SEND_REPEAT_START)
                {
                    UI2C_SET_DATA(ui2c, (uint16_t)(u8SlaveAddr << 1U) | 0x01U);         /* Write SLA+R to Register TXDAT */
                    eEvent = MASTER_SEND_H_RD_ADDRESS;
                }

                u8Ctrl = UI2C_CTL_PTRG;
                break;

            case UI2C_PROTSTS_ACKIF_Msk:
                UI2C_CLR_PROT_INT_FLAG(ui2c, UI2C_PROTSTS_ACKIF_Msk);      /* Clear ACK INT Flag */

                if(eEvent == MASTER_SEND_ADDRESS)
                {
                    UI2C_SET_DATA(ui2c, (uint8_t)(u16DataAddr & 0xFF00U) >> 8U);  /* Write Hi byte address of register */
                    eEvent = MASTER_SEND_DATA;
                }
                else if(eEvent == MASTER_SEND_DATA)
                {
                    if(u8Addr)
                    {
                        UI2C_SET_DATA(ui2c, (uint8_t)(u16DataAddr & 0xFFU));       /* Write Lo byte address of register */
                        u8Addr = 0;
                    }
                    else
                    {
                        u8Ctrl = (UI2C_CTL_PTRG | UI2C_CTL_STA);                /* Send repeat START signal */
                        eEvent = MASTER_SEND_REPEAT_START;
                    }
                }
                else if(eEvent == MASTER_SEND_H_RD_ADDRESS)
                {
                    u8Ctrl = (UI2C_CTL_PTRG | UI2C_CTL_AA);
                    eEvent = MASTER_READ_DATA;
                }
                else
                {
                    rdata[u32rxLen++] = (uint8_t) UI2C_GET_DATA(ui2c);      /* Receive Data */

                    if(u32rxLen < u32rLen - 1U)
                        u8Ctrl = (UI2C_CTL_PTRG | UI2C_CTL_AA);
                    else
                        u8Ctrl = UI2C_CTL_PTRG;
                }

                break;

            case UI2C_PROTSTS_NACKIF_Msk:
                UI2C_CLR_PROT_INT_FLAG(ui2c, UI2C_PROTSTS_NACKIF_Msk);     /* Clear NACK INT Flag */

                if(eEvent == MASTER_READ_DATA)
                    rdata[u32rxLen++] = (uint8_t) UI2C_GET_DATA(ui2c);                  /* Receive Data */

                u8Ctrl = (UI2C_CTL_PTRG | UI2C_CTL_STO);                        /* Clear SI and send STOP */

                break;

            case UI2C_PROTSTS_STORIF_Msk:
                UI2C_CLR_PROT_INT_FLAG(ui2c, UI2C_PROTSTS_STORIF_Msk);     /* Clear STOP INT Flag */
                u8Ctrl = UI2C_CTL_PTRG;                                     /* Clear SI */
                u8Xfering = 0U;
                break;

            case UI2C_PROTSTS_ARBLOIF_Msk:                                  /* Arbitration Lost */
            default:                                                        /* Unknow status */
                u8Ctrl = (UI2C_CTL_PTRG | UI2C_CTL_STO);                    /* Clear SI and send STOP */
                break;
        }

        UI2C_SET_CONTROL_REG(ui2c, u8Ctrl);                                 /* Write controlbit to UI2C_PROTCTL register */
    }

    return u32rxLen;                                                        /* Return bytes length that have been received */
}

/**@}*/ /* end of group USCI_I2C_EXPORTED_FUNCTIONS */

/**@}*/ /* end of group USCI_I2C_Driver */

/**@}*/ /* end of group Standard_Driver */

